Tekla Open API Reference for Tekla Structures 2025
PourObject.PourAttributes.OwnHiddenLines Property
 The line type of own hidden lines.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LineTypeAttributes OwnHiddenLines { get; set; }
Public Property OwnHiddenLines As LineTypeAttributes
	Get
	Set
Property Value
Type: LineTypeAttributes
See Also
Reference
PourObject.PourAttributes Class
Tekla.Structures.Drawing Namespace